rnavarro/openevse_esp32_firmware/src/net_manager.cpp
  displayState();

  Mongoose.ipConfigChanged();

  _led.setWifiMode(true, true);
  _lcd.setWifiMode(true, true);
  _time.setHost(sntp_hostname.c_str());

  _apAutoApStopTime = millis() + ACCESS_POINT_AUTO_STOP_TIMEOUT;

  _state = NetState::Connected;
}

void NetManagerTask::onGlobalIPv6Acquired(const char *ifkey)
{
  // mDNS AAAA workaround: swap global address into LwIP slot 0 so
  // the precompiled mDNS library (which only reads slot 0) advertises
  // the global address instead of the link-local.
  esp_netif_t *swap_netif = esp_netif_get_handle_from_ifkey(ifkey);
  if (swap_netif) {
    struct netif *lwip_nif = (struct netif *)esp_netif_get_netif_impl(swap_netif);
    if (lwip_nif &&
        ip6_addr_islinklocal(ip_2_ip6(&lwip_nif->ip6_addr[0])) &&
        !ip6_addr_isany(ip_2_ip6(&lwip_nif->ip6_addr[1])) &&
        !ip6_addr_islinklocal(ip_2_ip6(&lwip_nif->ip6_addr[1]))) {
      ip_addr_t tmp_addr = lwip_nif->ip6_addr[0];
      lwip_nif->ip6_addr[0] = lwip_nif->ip6_addr[1];
      lwip_nif->ip6_addr[1] = tmp_addr;
      u8_t tmp_state = lwip_nif->ip6_addr_state[0];
      lwip_nif->ip6_addr_state[0] = lwip_nif->ip6_addr_state[1];
      lwip_nif->ip6_addr_state[1] = tmp_state;
      u32_t tmp_valid = lwip_nif->ip6_addr_valid_life[0];
      lwip_nif->ip6_addr_valid_life[0] = lwip_nif->ip6_addr_valid_life[1];
      lwip_nif->ip6_addr_valid_life[1] = tmp_valid;
      u32_t tmp_pref = lwip_nif->ip6_addr_pref_life[0];
      lwip_nif->ip6_addr_pref_life[0] = lwip_nif->ip6_addr_pref_life[1];
      lwip_nif->ip6_addr_pref_life[1] = tmp_pref;
      DEBUG.printf("mDNS: swapped global IPv6 into slot 0 on %s\r\n", ifkey);
    }
  }

  // Restart mDNS to pick up the swapped address
  mdns_free();
  if (mdns_init() == ESP_OK) {
    mdns_hostname_set(esp_hostname.c_str());
    mdns_instance_name_set(esp_hostname.c_str());
    mdns_service_add(NULL, "_http", "_tcp", 80, NULL, 0);
    mdns_service_add(NULL, "_openevse", "_tcp", 80, NULL, 0);
    mdns_service_txt_item_set("_openevse", "_tcp", "type", buildenv.c_str());
    mdns_service_txt_item_set("_openevse", "_tcp", "version", currentfirmware.c_str());
    mdns_service_txt_item_set("_openevse", "_tcp", "id", ESPAL.getLongId().c_str());
    DEBUG.printf("mDNS: restarted with global IPv6\r\n");
  } else {
    DEBUG.printf("mDNS: restart FAILED\r\n");
  }

  // Notify subscribers (MQTT, OCPP, etc.) that global IPv6 is now available.
  // Each service decides its own upgrade policy in its listener.
  _ipv6GlobalChanged.Fire();

  // Notify web UI and other event subscribers
  StaticJsonDocument<128> doc;
  doc["ipv6_global"] = getIpv6Global();
  doc["ipv6_event"] = "acquired";
  event_send(doc);
}

void NetManagerTask::handleGotIPv6(esp_ip6_addr_t &addr, const char *ifkey, const char *label)
{
  esp_ip6_addr_type_t addr_type = esp_netif_ip6_get_addr_type(&addr);
  String addr_str = IPv6Address(addr.addr).toString();

  if (addr_type == ESP_IP6_ADDR_IS_LINK_LOCAL) {
#ifdef ENABLE_WIRED_ETHERNET
    if (strcmp(ifkey, "ETH_DEF") == 0) {
      _ipv6address_linklocal_eth = addr_str;
    } else
#endif
    {
      _ipv6address_linklocal_wifi = addr_str;
    }
    DEBUG.printf("Connected, %s IPv6 link-local: %s\r\n", label, addr_str.c_str());
  } else if (addr_type == ESP_IP6_ADDR_IS_GLOBAL || addr_type == ESP_IP6_ADDR_IS_UNIQUE_LOCAL) {
    String *global_field = nullptr;
#ifdef ENABLE_WIRED_ETHERNET
    if (strcmp(ifkey, "ETH_DEF") == 0) {
      global_field = &_ipv6address_global_eth;
    } else
#endif
    {
      global_field = &_ipv6address_global_wifi;
    }
    bool had_global = global_field && global_field->length() > 0;
    if (global_field) *global_field = addr_str;
    DEBUG.printf("Connected, %s IPv6 global: %s\r\n", label, addr_str.c_str());
    if (!had_global) {
      onGlobalIPv6Acquired(ifkey);
    }
  }
  Mongoose.ipConfigChanged();
}

void NetManagerTask::onGlobalIPv6Lost(const char *ifkey)
{
  // Only clear the global address for the interface that lost connectivity.
  // Link-local is tied to the interface MAC and persists across
  // reassociations — it should only be cleared on interface stop,
  // not on transient disconnects. It will be updated naturally when
  // the next GOT_IP6 event fires after reconnection.
  String *global_field = nullptr;
#ifdef ENABLE_WIRED_ETHERNET
  if (strcmp(ifkey, "ETH_DEF") == 0) {
    global_field = &_ipv6address_global_eth;
  } else
#endif
  if (strcmp(ifkey, "WIFI_STA_DEF") == 0) {
    global_field = &_ipv6address_global_wifi;
  }

  bool had_global = global_field && global_field->length() > 0;
  if (had_global) {
    *global_field = "";
    _ipv6GlobalChanged.Fire();

    StaticJsonDocument<64> doc;
    doc["ipv6_global"] = getIpv6Global();
    doc["ipv6_event"] = "lost";
    event_send(doc);
  }
}

void NetManagerTask::wifiOnStationModeConnected(const WiFiEventStationModeConnected &event) {
  DBUGF("Connected to %s", event.ssid.c_str());
}

void NetManagerTask::wifiOnStationModeGotIP(const WiFiEventStationModeGotIP &event)
{
  haveNetworkConnection(WiFi.localIP());
  _macaddress = WiFi.macAddress();
  StaticJsonDocument<128> doc;
  doc["wifi_client_connected"] = (int)net.isWifiClientConnected();
  doc["eth_connected"] = (int)net.isWiredConnected();
  doc["net_connected"] = (int)net.isWifiClientConnected();
  doc["ipaddress"] = net.getIp();
  doc["macaddress"] = net.getMac();
  event_send(doc);

  // Clear any error state
  _clientDisconnects = 0;
}

void NetManagerTask::wifiOnStationModeDisconnected(const WiFiEventStationModeDisconnected &event)
{
  onGlobalIPv6Lost("WIFI_STA_DEF");

  DBUGF("WiFi dissconnected: %s",
    WIFI_DISCONNECT_REASON_UNSPECIFIED == event.reason ? "WIFI_DISCONNECT_REASON_UNSPECIFIED" :
    WIFI_DISCONNECT_REASON_AUTH_EXPIRE == event.reason ? "WIFI_DISCONNECT_REASON_AUTH_EXPIRE" :
    WIFI_DISCONNECT_REASON_AUTH_LEAVE == event.reason ? "WIFI_DISCONNECT_REASON_AUTH_LEAVE" :
    WIFI_DISCONNECT_REASON_ASSOC_EXPIRE == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_EXPIRE" :
    WIFI_DISCONNECT_REASON_ASSOC_TOOMANY == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_TOOMANY" :
    WIFI_DISCONNECT_REASON_NOT_AUTHED == event.reason ? "WIFI_DISCONNECT_REASON_NOT_AUTHED" :
    WIFI_DISCONNECT_REASON_NOT_ASSOCED == event.reason ? "WIFI_DISCONNECT_REASON_NOT_ASSOCED" :
    WIFI_DISCONNECT_REASON_ASSOC_LEAVE == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_LEAVE" :
    WIFI_DISCONNECT_REASON_ASSOC_NOT_AUTHED == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_NOT_AUTHED" :
    WIFI_DISCONNECT_REASON_DISASSOC_PWRCAP_BAD == event.reason ? "WIFI_DISCONNECT_REASON_DISASSOC_PWRCAP_BAD" :
    WIFI_DISCONNECT_REASON_DISASSOC_SUPCHAN_BAD == event.reason ? "WIFI_DISCONNECT_REASON_DISASSOC_SUPCHAN_BAD" :
    WIFI_DISCONNECT_REASON_IE_INVALID == event.reason ? "WIFI_DISCONNECT_REASON_IE_INVALID" :
    WIFI_DISCONNECT_REASON_MIC_FAILURE == event.reason ? "WIFI_DISCONNECT_REASON_MIC_FAILURE" :
    WIFI_DISCONNECT_REASON_4WAY_HANDSHAKE_TIMEOUT == event.reason ? "WIFI_DISCONNECT_REASON_4WAY_HANDSHAKE_TIMEOUT" :
    WIFI_DISCONNECT_REASON_GROUP_KEY_UPDATE_TIMEOUT == event.reason ? "WIFI_DISCONNECT_REASON_GROUP_KEY_UPDATE_TIMEOUT" :
    WIFI_DISCONNECT_REASON_IE_IN_4WAY_DIFFERS == event.reason ? "WIFI_DISCONNECT_REASON_IE_IN_4WAY_DIFFERS" :
    WIFI_DISCONNECT_REASON_GROUP_CIPHER_INVALID == event.reason ? "WIFI_DISCONNECT_REASON_GROUP_CIPHER_INVALID" :
    WIFI_DISCONNECT_REASON_PAIRWISE_CIPHER_INVALID == event.reason ? "WIFI_DISCONNECT_REASON_PAIRWISE_CIPHER_INVALID" :
    WIFI_DISCONNECT_REASON_AKMP_INVALID == event.reason ? "WIFI_DISCONNECT_REASON_AKMP_INVALID" :
    WIFI_DISCONNECT_REASON_UNSUPP_RSN_IE_VERSION == event.reason ? "WIFI_DISCONNECT_REASON_UNSUPP_RSN_IE_VERSION" :
    WIFI_DISCONNECT_REASON_INVALID_RSN_IE_CAP == event.reason ? "WIFI_DISCONNECT_REASON_INVALID_RSN_IE_CAP" :
    WIFI_DISCONNECT_REASON_802_1X_AUTH_FAILED == event.reason ? "WIFI_DISCONNECT_REASON_802_1X_AUTH_FAILED" :
    WIFI_DISCONNECT_REASON_CIPHER_SUITE_REJECTED == event.reason ? "WIFI_DISCONNECT_REASON_CIPHER_SUITE_REJECTED" :
    WIFI_DISCONNECT_REASON_BEACON_TIMEOUT == event.reason ? "WIFI_DISCONNECT_REASON_BEACON_TIMEOUT" :
    WIFI_DISCONNECT_REASON_NO_AP_FOUND == event.reason ? "WIFI_DISCONNECT_REASON_NO_AP_FOUND" :
    WIFI_DISCONNECT_REASON_AUTH_FAIL == event.reason ? "WIFI_DISCONNECT_REASON_AUTH_FAIL" :
    WIFI_DISCONNECT_REASON_ASSOC_FAIL == event.reason ? "WIFI_DISCONNECT_REASON_ASSOC_FAIL" :
    WIFI_DISCONNECT_REASON_HANDSHAKE_TIMEOUT == event.reason ? "WIFI_DISCONNECT_REASON_HANDSHAKE_TIMEOUT" :
    "UNKNOWN");

