rnavarro/openevse_esp32_firmware/src/net_manager.cpp
  _clientDisconnects++;

  // Clear the WiFi state and try to connect again
  WiFi.disconnect(true);

  if(!isWiredConnected() && NetState::Connected == _state) {
    wifiStart();
  }
}

void NetManagerTask::wifiOnAPModeStationConnected(const WiFiEventSoftAPModeStationConnected &event)
{
  _lcd.display(F("IP Address"), 0, 0, 0, LCD_CLEAR_LINE);
  _lcd.display(_ipaddress, 0, 1, (0 == _apClients ? 15 : 5) * 1000, LCD_CLEAR_LINE);

  _led.setWifiMode(false, true);
  _lcd.setWifiMode(false, true);
  _apClients++;
}

void NetManagerTask::wifiOnAPModeStationDisconnected(const WiFiEventSoftAPModeStationDisconnected &event)
{
  _apClients--;

  if(0 == _apClients && NetState::AccessPointConnecting == _state) {
    _led.setWifiMode(false, false);
    _lcd.setWifiMode(false, false);
  }
}

#ifdef ESP32

void NetManagerTask::onNetEventStatic(WiFiEvent_t event, arduino_event_info_t info)
{
  if(_instance) {
    _instance->send(new NetworkEventMessage(event, info));
  }
}

void NetManagerTask::onNetEvent(WiFiEvent_t event, arduino_event_info_t &info)
{
  DBUGF("Got Network event %s",
    ARDUINO_EVENT_WIFI_READY == event ? "ARDUINO_EVENT_WIFI_READY" :
    ARDUINO_EVENT_WIFI_SCAN_DONE == event ? "ARDUINO_EVENT_WIFI_SCAN_DONE" :
    ARDUINO_EVENT_WIFI_STA_START == event ? "ARDUINO_EVENT_WIFI_STA_START" :
    ARDUINO_EVENT_WIFI_STA_STOP == event ? "ARDUINO_EVENT_WIFI_STA_STOP" :
    ARDUINO_EVENT_WIFI_STA_CONNECTED == event ? "ARDUINO_EVENT_WIFI_STA_CONNECTED" :
    ARDUINO_EVENT_WIFI_STA_DISCONNECTED == event ? "ARDUINO_EVENT_WIFI_STA_DISCONNECTED" :
    ARDUINO_EVENT_WIFI_STA_AUTHMODE_CHANGE == event ? "ARDUINO_EVENT_WIFI_STA_AUTHMODE_CHANGE" :
    ARDUINO_EVENT_WIFI_STA_GOT_IP == event ? "ARDUINO_EVENT_WIFI_STA_GOT_IP" :
    ARDUINO_EVENT_WIFI_STA_GOT_IP6 == event ? "ARDUINO_EVENT_WIFI_STA_GOT_IP6" :
    ARDUINO_EVENT_WIFI_STA_LOST_IP == event ? "ARDUINO_EVENT_WIFI_STA_LOST_IP" :
    ARDUINO_EVENT_WIFI_AP_START == event ? "ARDUINO_EVENT_WIFI_AP_START" :
    ARDUINO_EVENT_WIFI_AP_STOP == event ? "ARDUINO_EVENT_WIFI_AP_STOP" :
    ARDUINO_EVENT_WIFI_AP_STACONNECTED == event ? "ARDUINO_EVENT_WIFI_AP_STACONNECTED" :
    ARDUINO_EVENT_WIFI_AP_STADISCONNECTED == event ? "ARDUINO_EVENT_WIFI_AP_STADISCONNECTED" :
    ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED == event ? "ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED" :
    ARDUINO_EVENT_WIFI_AP_PROBEREQRECVED == event ? "ARDUINO_EVENT_WIFI_AP_PROBEREQRECVED" :
    ARDUINO_EVENT_WIFI_AP_GOT_IP6 == event ? "ARDUINO_EVENT_WIFI_AP_GOT_IP6" :
    ARDUINO_EVENT_WIFI_FTM_REPORT == event ? "ARDUINO_EVENT_WIFI_FTM_REPORT" :
    ARDUINO_EVENT_ETH_START == event ? "ARDUINO_EVENT_ETH_START" :
    ARDUINO_EVENT_ETH_STOP == event ? "ARDUINO_EVENT_ETH_STOP" :
    ARDUINO_EVENT_ETH_CONNECTED == event ? "ARDUINO_EVENT_ETH_CONNECTED" :
    ARDUINO_EVENT_ETH_DISCONNECTED == event ? "ARDUINO_EVENT_ETH_DISCONNECTED" :
    ARDUINO_EVENT_ETH_GOT_IP == event ? "ARDUINO_EVENT_ETH_GOT_IP" :
    ARDUINO_EVENT_ETH_GOT_IP6 == event ? "ARDUINO_EVENT_ETH_GOT_IP6" :
    ARDUINO_EVENT_WPS_ER_SUCCESS == event ? "ARDUINO_EVENT_WPS_ER_SUCCESS" :
    ARDUINO_EVENT_WPS_ER_FAILED == event ? "ARDUINO_EVENT_WPS_ER_FAILED" :
    ARDUINO_EVENT_WPS_ER_TIMEOUT == event ? "ARDUINO_EVENT_WPS_ER_TIMEOUT" :
    ARDUINO_EVENT_WPS_ER_PIN == event ? "ARDUINO_EVENT_WPS_ER_PIN" :
    ARDUINO_EVENT_WPS_ER_PBC_OVERLAP == event ? "ARDUINO_EVENT_WPS_ER_PBC_OVERLAP" :
    ARDUINO_EVENT_SC_SCAN_DONE == event ? "ARDUINO_EVENT_SC_SCAN_DONE" :
    ARDUINO_EVENT_SC_FOUND_CHANNEL == event ? "ARDUINO_EVENT_SC_FOUND_CHANNEL" :
    ARDUINO_EVENT_SC_GOT_SSID_PSWD == event ? "ARDUINO_EVENT_SC_GOT_SSID_PSWD" :
    ARDUINO_EVENT_SC_SEND_ACK_DONE == event ? "ARDUINO_EVENT_SC_SEND_ACK_DONE" :
    ARDUINO_EVENT_PROV_INIT == event ? "ARDUINO_EVENT_PROV_INIT" :
    ARDUINO_EVENT_PROV_DEINIT == event ? "ARDUINO_EVENT_PROV_DEINIT" :
    ARDUINO_EVENT_PROV_START == event ? "ARDUINO_EVENT_PROV_START" :
    ARDUINO_EVENT_PROV_END == event ? "ARDUINO_EVENT_PROV_END" :
    ARDUINO_EVENT_PROV_CRED_RECV == event ? "ARDUINO_EVENT_PROV_CRED_RECV" :
    ARDUINO_EVENT_PROV_CRED_FAIL == event ? "ARDUINO_EVENT_PROV_CRED_FAIL" :
    ARDUINO_EVENT_PROV_CRED_SUCCESS == event ? "ARDUINO_EVENT_PROV_CRED_SUCCESS" :
    "UNKNOWN"
  );

  DBUGF("WiFi State %s",
        NetState::Starting == _state ? "Starting" :
        NetState::WiredConnecting == _state ? "WiredConnecting" :
        NetState::AccessPointConnecting == _state ? "AccessPointConnecting" :
        NetState::StationClientConnecting == _state ? "StationClientConnecting" :
        NetState::StationClientReconnecting == _state ? "StationClientReconnecting" :
        NetState::Connected == _state ? "Connected" :
        "UNKNOWN");

  //WiFi.printDiag(DEBUG_PORT);
  wifi_mode_t mode = WiFi.getMode();
  DBUGF("WiFi Mode %s",
        WIFI_OFF == mode ? "OFF" :
        WIFI_STA == mode ? "STA" :
        WIFI_AP == mode ? "AP" :
        WIFI_AP_STA == mode ? "AP+STA" :
        "UNKNOWN");

  switch (event)
  {
    case ARDUINO_EVENT_WIFI_AP_START:
    {
      if(WiFi.softAPsetHostname(esp_hostname.c_str())) {
        DBUGF("Set host name to %s", WiFi.softAPgetHostname());
      } else {
        DBUGF("Setting host name failed: %s", esp_hostname.c_str());
      }
    } break;

    case ARDUINO_EVENT_WIFI_STA_START:
    {
      if(WiFi.setHostname(esp_hostname.c_str())) {
        DBUGF("Set host name to %s", WiFi.getHostname());
      } else {
        DBUGF("Setting host name failed: %s", esp_hostname.c_str());
      }
    } break;

    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
    {
      auto& src = info.wifi_sta_connected;
      WiFiEventStationModeConnected dst;
      dst.ssid = String(reinterpret_cast<char*>(src.ssid));
      memcpy(dst.bssid, src.bssid, 6);
      dst.channel = src.channel;
      wifiOnStationModeConnected(dst);
      WiFi.enableIpV6();  // Re-enable IPv6 after disconnect cleared it
    } break;

    case ARDUINO_EVENT_WIFI_STA_STOP:
    {
      // Interface is going down completely — clear both global and link-local
      _ipv6address_global_wifi = "";
      _ipv6address_linklocal_wifi = "";
    } break;

    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    {
      auto& src = info.wifi_sta_disconnected;
      WiFiEventStationModeDisconnected dst;
      dst.ssid = String(reinterpret_cast<char*>(src.ssid));
      memcpy(dst.bssid, src.bssid, 6);
      dst.reason = static_cast<WiFiDisconnectReason>(src.reason);
      wifiOnStationModeDisconnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    {
      auto& src = info.got_ip.ip_info;
      WiFiEventStationModeGotIP dst;
      dst.ip = src.ip.addr;
      dst.mask = src.netmask.addr;
      dst.gw = src.gw.addr;
      wifiOnStationModeGotIP(dst);
    } break;

    case ARDUINO_EVENT_WIFI_STA_GOT_IP6:
    {
      esp_ip6_addr_t addr = info.got_ip6.ip6_info.ip;
      handleGotIPv6(addr, "WIFI_STA_DEF", "WiFi");
    } break;

    case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
    {
      auto& src = info.wifi_ap_staconnected;
      WiFiEventSoftAPModeStationConnected dst;
      memcpy(dst.mac, src.mac, 6);
      dst.aid = src.aid;
      wifiOnAPModeStationConnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
    {
      auto& src = info.wifi_ap_stadisconnected;
      WiFiEventSoftAPModeStationDisconnected dst;
      memcpy(dst.mac, src.mac, 6);
      dst.aid = src.aid;
      wifiOnAPModeStationDisconnected(dst);
    } break;

    case ARDUINO_EVENT_WIFI_SCAN_DONE:
    {
      for(WiFiScanCompleteCallback callback : _scanCompleteCallbacks) {
        callback(info.wifi_scan_done.number);
      }

      _scanCompleteCallbacks.clear();
      WiFi.scanDelete();
    } break;
#ifdef ENABLE_WIRED_ETHERNET
    case ARDUINO_EVENT_ETH_START:
      DBUGF("ETH Started, link %s", ETH.linkUp() ? "up" : "down");
      if(ETH.linkUp())
      {
        //set eth hostname here
        if(ETH.setHostname(esp_hostname.c_str())) {
          DBUGF("Set host name to %s", ETH.getHostname());
        } else {
          DBUGF("Setting host name failed: %s", esp_hostname.c_str());
        }
      } else {
        wifiStartInternal();
      }
      break;
    case ARDUINO_EVENT_ETH_CONNECTED:
      DBUGLN("ETH Connected");
      ETH.enableIpV6();  // Request IPv6 on ETH interface (v2.x API, uppercase V)
      break;
    case ARDUINO_EVENT_ETH_GOT_IP:
      DBUG("ETH MAC: ");
      DBUG(ETH.macAddress());
      DBUG(", IPv4: ");
      DBUG(ETH.localIP());
      if (ETH.fullDuplex()) {
        DBUG(", FULL_DUPLEX");
      }
      DBUG(", ");
      DBUG(ETH.linkSpeed());
      DBUGLN("Mbps");
      haveNetworkConnection(ETH.localIP());
      _macaddress = ETH.macAddress();
      _ethConnected = true;
      wifiStop();
      break;
    case ARDUINO_EVENT_ETH_GOT_IP6:
    {
      esp_ip6_addr_t addr = info.got_ip6.ip6_info.ip;
      handleGotIPv6(addr, "ETH_DEF", "ETH");
    } break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
      DBUGLN("ETH Disconnected");
      onGlobalIPv6Lost("ETH_DEF");
      _ethConnected = false;
      wifiStart();
      break;
    case ARDUINO_EVENT_ETH_STOP:
      DBUGLN("ETH Stopped");
      onGlobalIPv6Lost("ETH_DEF");
      _ipv6address_linklocal_eth = "";  // Interface going down — clear link-local too
      _ethConnected = false;
      break;
#endif
    default:
      break;
  }
}
#endif

void NetManagerTask::setup()
{
  DBUGLN("Starting Network Manager");

  // This is not really needed for our usecase on the ESP32, because random(n) uses theESP32 hardware random number
  // generator, but random() does not so safest to add some entropy here
  randomSeed(millis() | analogRead(RANDOM_SEED_CHANNEL));

