rnavarro/openevse_esp32_firmware/src/net_manager.cpp
  return nextLoopDelay;
}

#ifdef ENABLE_WIRED_ETHERNET
void NetManagerTask::wiredStart()
{
  DBUGLN("Starting wired connection");
  //ETH.setHostname(esp_hostname.c_str());
  // https://github.com/espressif/arduino-esp32/pull/6188/files
  pinMode(ETH_PHY_POWER, OUTPUT);
#ifdef RESET_ETH_PHY_ON_BOOT
  digitalWrite(ETH_PHY_POWER, LOW);
  delay(350);
#endif // #ifdef RESET_ETH_PHY_ON_BOOT
  digitalWrite(ETH_PHY_POWER, HIGH);
  ETH.begin();

  _state = NetState::WiredConnecting;
  _wiredTimeout = millis() + WIRED_CONNECT_TIMEOUT;
}
#endif

void NetManagerTask::wifiStartInternal()
{
  _clientDisconnects = 0;

  // 1) If no network configured start up access point
  if (esid == 0 || esid == "")
  {
    wifiStartAccessPoint();
  }
  // 2) else try and connect to the configured network
  else
  {
    wifiStartClient();
  }
}

void NetManagerTask::wifiStopInternal()
{
  wifiTurnOffAp();
  if (isWifiModeSta()) {
    WiFi.disconnect(true);
  }
}

void NetManagerTask::wifiStart()
{
  DBUGF("NetManagerTask::wifiStart %d", WiFi.getMode());
  send(new NetMessage(NetMessage::WiFiStart));
}

void NetManagerTask::wifiStop()
{
  DBUGF("NetManagerTask::wifiStop %d", WiFi.getMode());
  send(new NetMessage(NetMessage::WiFiStop));
}

void NetManagerTask::wifiRestart()
{
  DBUGF("NetManagerTask::wifiRestart %d", WiFi.getMode());
  send(new NetMessage(NetMessage::WiFiRestart));
}

void NetManagerTask::wifiTurnOffAp()
{
  DBUGF("NetManagerTask::wifiTurnOffAp %d", WiFi.getMode());
  if(isWifiModeAp()) {
    send(new NetMessage(NetMessage::WiFiAccessPointDisable));
  }
}

void NetManagerTask::wifiTurnOnAp()
{
  DBUGF("NetManagerTask::wifiTurnOnAp %d", WiFi.getMode());
  if(!isWifiModeAp()) {
    send(new NetMessage(NetMessage::WiFiAccessPointEnable));
  }
}

bool NetManagerTask::isConnected()
{
  return isWifiClientConnected() || isWiredConnected();
}

bool NetManagerTask::isWifiClientConnected()
{
  return WiFi.isConnected() && isWifiModeSta();
}

bool NetManagerTask::isWiredConnected()
{
#ifdef ENABLE_WIRED_ETHERNET
  return _ethConnected;
#else
  return false;
#endif
}